Revit 2026 API

# TextRangeLength Property

---

The length of the range.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Length { get; set; }
```
```vb
Public Property Length As Integer
	Get
	Set
```
```cpp
public:
property int Length {
	int get ();
	void set (int value);
}
```
```fsharp
member Length : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for length is negative. |

#### Reference

TextRange Class

Autodesk.Revit.DB Namespace